# --- Сообщения для пользователя ---
MSG_START = "Привет! 👋\nОтправь мне ссылку на TikTok, Reels или YouTube Shorts, и я скачаю видео."
MSG_WAIT = "⏳"  # То, что ты хотел
MSG_CAPTION = "{bot_name}" # Подпись под видео
MSG_SUCCESS = "Готово! ✅"
MSG_TIKTOK_CAROUSEL_NOT_SUPPORTED = "⚠️ Пока не поддерживаем TikTok фото-альбомы (карусели). Отправьте ссылку на видео."

# --- Ошибки ---
MSG_ERR_LINK = "⚠️ Ссылка не поддерживается или домен запрещен"
MSG_ERR_SEND = "Ошибка отправки файла (возможно, он слишком большой)."

MSG_VIDEO_MESSAGE = (
    "📹 Режим видеосообщения:\n"

    "Отправьте мне видео (или перешлите).\n"

    "❗️ Формат: желательно 1:1\n"
    "❗️ Длительность: до 1 минуты"
)

MSG_DISABLE_MODULE = "Этот модуль отключен администратором."