STRINGS = {
    # UI
    'start_hello': "👋 <b>Привет, {name}!</b>\n\nЯ универсальный загрузчик.\nОтправь мне ссылку, чтобы начать.\n\n🌍 Сменить язык: /language",
    'language_select': "🌍 <b>Выберите язык:</b>",
    'language_set': "✅ Язык изменен на <b>Русский</b>.",
    
    # Common
    'platforms': "Платформы",
    
    # Commands
    'cmd_start': "Перезапустить бота",
    'cmd_login': "Привязать Last.fm",
    'cmd_language': "Сменить язык / Language",
    'cmd_videomessage': "Сделать кружочек",
    'req_by': "• Request by {user}",
    
    # Admin
    'cmd_users': "Список пользователей",
    'cmd_ban': "Бан (нажми и введи ID)",
    'cmd_unban': "Разбан (нажми и введи ID)",
    'cmd_answer': "Ответ (нажми и введи ID)",
    'cmd_status': "Состояние системы",
    'cmd_check': "Health Check (Проверка)",
    'cmd_update': "Обновить с GitHub",
    'cmd_clearcache': "Очистить кэш файлов",
    'cmd_fix_ffmpeg': "Переустановить FFmpeg",
    'cmd_get_placeholder': "ID видео-заглушки",
    'cmd_get_audio_placeholder': "ID аудио-заглушки",
    'cmd_modules': "Управление модулями",
    'cmd_return_local': "Попытка вернуть Локальный сервер",
    'cmd_exec': "Python Console",

    # Messages
    'wait': "⏳",
    'error': "❌ Ошибка: {error}",
    'error_link': "⚠️ Ссылка не поддерживается.",
    'module_disabled': "⚠️ Этот модуль временно отключен.",
    'auth_required': "🔒 <b>Требуется доступ.</b>\nПришлите файл <code>cookies.txt</code>.",
    'cookies_saved': "🍪 <b>Куки сохранены!</b>",
    'nothing_found': "🔍 Ничего не найдено.",
    'search_title': "🔎 <b>Результаты поиска:</b>\n<code>{query}</code>",
    'btn_close': "❌ Закрыть",
}